# CalPerS Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..CalPerS Property
SymbolTypeId Class See Also
---
Symbol cal/s, indicating unit Calories per second.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId CalPerS { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CalPerS As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CalPerS {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace